burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_poc.h
/*!
    \file    gd32m53x_poc.h
    \brief   POC driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_POC_H
#define GD32M53X_POC_H

#include "gd32m53x.h"

/* POC definitions */
#define POC                                   POC_BASE                               /*!< POC base address */

/* registers definitions */
#define POC_STAT0                             REG32(POC + 0x00000000U)               /*!< POC status register 0 */
#define POC_IN0DCFG                           REG32(POC + 0x00000004U)               /*!< POC input 0 detection configuration register */
#define POC_IN1DCFG                           REG32(POC + 0x00000008U)               /*!< POC input 1 detection configuration register */
#define POC_IN2DCFG                           REG32(POC + 0x0000000CU)               /*!< POC input 2 detection configuration register */
#define POC_IN3DCFG                           REG32(POC + 0x00000010U)               /*!< POC input 3 detection configuration register */
#define POC_IN4DCFG                           REG32(POC + 0x00000014U)               /*!< POC input 4 detection configuration register */
#define POC_IN5DCFG                           REG32(POC + 0x00000018U)               /*!< POC input 5 detection configuration register */
#define POC_CTL0                              REG32(POC + 0x00000020U)               /*!< POC control register 0 */
#define POC_SWDRG                             REG32(POC + 0x00000024U)               /*!< POC software disabling request generation register */
#define POC_CDCFG0                            REG32(POC + 0x00000028U)               /*!< POC complementary detection configuration register 0 */
#define POC_CDCFG1                            REG32(POC + 0x0000002CU)               /*!< POC complementary detection configuration register 1 */
#define POC_ODMODE0                           REG32(POC + 0x00000040U)               /*!< POC output disable mode register 0 */
#define POC_ODMODE1                           REG32(POC + 0x00000044U)               /*!< POC output disable mode register 1 */
#define POC_REQSEL0                           REG32(POC + 0x00000048U)               /*!< POC request selection register 0 */
#define POC_REQSEL1                           REG32(POC + 0x0000004CU)               /*!< POC request selection register 1 */
#define POC_STAT1                             REG32(POC + 0x00000060U)               /*!< POC status register 1 */
#define POC_CTL1                              REG32(POC + 0x00000064U)               /*!< POC control register 1 */
#define POC_EXTCTL0                           REG32(POC + 0x00000068U)               /*!< POC extended control register 0 */
#define POC_EXTCTL1                           REG32(POC + 0x0000006CU)               /*!< POC extended control register 1 */
#define POC_IN0DMK                            REG32(POC + 0x00000070U)               /*!< POC input 0 detection mask register */
#define POC_IN1DMK                            REG32(POC + 0x00000074U)               /*!< POC input 1 detection mask register */
#define POC_IN2DMK                            REG32(POC + 0x00000078U)               /*!< POC input 2 detection mask register */
#define POC_IN3DMK                            REG32(POC + 0x0000007CU)               /*!< POC input 3 detection mask register */
#define POC_IN4DMK                            REG32(POC + 0x00000080U)               /*!< POC input 4 detection mask register */
#define POC_IN5DMK                            REG32(POC + 0x00000084U)               /*!< POC input 5 detection mask register */
#define POC_CMP0DMK                           REG32(POC + 0x00000090U)               /*!< POC comparator 0 detection mask register */
#define POC_CMP1DMK                           REG32(POC + 0x00000094U)               /*!< POC comparator 1 detection mask register */
#define POC_CMP2DMK                           REG32(POC + 0x00000098U)               /*!< POC comparator 2 detection mask register */
#define POC_CMP3DMK                           REG32(POC + 0x0000009CU)               /*!< POC comparator 3 detection mask register */

/* registers byte definitions */
#define POC_IN0DCFG_7_0                         REG8(POC + 0x00000004U)              /*!< POC input 0 detection configuration register 0-7 bits */
#define POC_IN0DCFG_15_8                        REG8(POC + 0x00000005U)              /*!< POC input 0 detection configuration register 15-8 bits */
#define POC_IN1DCFG_7_0                         REG8(POC + 0x00000008U)              /*!< POC input 1 detection configuration register 0-7 bits */
#define POC_IN1DCFG_15_8                        REG8(POC + 0x00000009U)              /*!< POC input 1 detection configuration register 15-8 bits */
#define POC_IN2DCFG_7_0                         REG8(POC + 0x0000000CU)              /*!< POC input 2 detection configuration register 0-7 bits */
#define POC_IN2DCFG_15_8                        REG8(POC + 0x0000000DU)              /*!< POC input 2 detection configuration register 15-8 bits */
#define POC_IN3DCFG_7_0                         REG8(POC + 0x00000010U)              /*!< POC input 3 detection configuration register 0-7 bits */
#define POC_IN3DCFG_15_8                        REG8(POC + 0x00000011U)              /*!< POC input 3 detection configuration register 15-8 bits */
#define POC_IN4DCFG_7_0                         REG8(POC + 0x00000014U)              /*!< POC input 4 detection configuration register 0-7 bits */
#define POC_IN4DCFG_15_8                        REG8(POC + 0x00000015U)              /*!< POC input 4 detection configuration register 15-8 bits */
#define POC_IN5DCFG_7_0                         REG8(POC + 0x00000018U)              /*!< POC input 5 detection configuration register 0-7 bits */
#define POC_IN5DCFG_15_8                        REG8(POC + 0x00000019U)              /*!< POC input 5 detection configuration register 15-8 bits */
#define POC_ODMODE0_TIMER0                      REG8(POC + 0x00000040U)              /*!< POC output disable mode register 0 for TIMER0 */
#define POC_ODMODE0_TIMER7                      REG8(POC + 0x00000041U)              /*!< POC output disable mode register 0 for TIMER7 */
#define POC_ODMODE1_TIMER1                      REG8(POC + 0x00000044U)              /*!< POC output disable mode register 1 for TIMER1 */
#define POC_ODMODE1_TIMER2                      REG8(POC + 0x00000045U)              /*!< POC output disable mode register 1 for TIMER2 */
#define POC_ODMODE1_GPTIMER0                    REG8(POC + 0x00000046U)              /*!< POC output disable mode register 1 for GPTIMER0 */
#define POC_ODMODE1_GPTIMER1                    REG8(POC + 0x00000047U)              /*!< POC output disable mode register 1 for GPTIMER1 */
#define POC_REQSEL0_TIMER0                      REG8(POC + 0x00000048U)              /*!< POC request selection register 0 for TIMER0 */
#define POC_REQSEL0_TIMER7                      REG8(POC + 0x00000049U)              /*!< POC request selection register 0 for TIMER7 */
#define POC_REQSEL1_TIMER1                      REG8(POC + 0x0000004CU)              /*!< POC request selection register 1 for TIMER1 */
#define POC_REQSEL1_TIMER2                      REG8(POC + 0x0000004DU)              /*!< POC request selection register 1 for TIMER2 */
#define POC_REQSEL1_GPTIMER0                    REG8(POC + 0x0000004EU)              /*!< POC request selection register 1 for GPTIMER0 */
#define POC_REQSEL1_GPTIMER1                    REG8(POC + 0x0000004FU)              /*!< POC request selection register 1 for GPTIMER1 */
#define POC_EXTCTL0_TIMER0                      REG8(POC + 0x00000068U)              /*!< POC extended control register 0 for TIMER0 */
#define POC_EXTCTL0_TIMER7                      REG8(POC + 0x00000069U)              /*!< POC extended control register 0 for TIMER7 */
#define POC_EXTCTL1_TIMER1                      REG8(POC + 0x0000006CU)              /*!< POC extended control register 1 for TIMER1 */
#define POC_EXTCTL1_TIMER2                      REG8(POC + 0x0000006DU)              /*!< POC extended control register 1 for TIMER2 */
#define POC_EXTCTL1_GPTIMER0                    REG8(POC + 0x0000006EU)              /*!< POC extended control register 1 for GPTIMER0 */
#define POC_EXTCTL1_GPTIMER1                    REG8(POC + 0x0000006FU)              /*!< POC extended control register 1 for GPTIMER1 */

