burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_poc.h
/* bits definitions */
/* POC_STAT0 */
#define POC_STAT0_IN0IF                      BIT(0)                                  /*!< POC_IN0 input interrupt flag */
#define POC_STAT0_IN1IF                      BIT(1)                                  /*!< POC_IN1 input interrupt flag */
#define POC_STAT0_IN2IF                      BIT(2)                                  /*!< POC_IN2 input interrupt flag */
#define POC_STAT0_IN3IF                      BIT(3)                                  /*!< POC_IN3 input interrupt flag */
#define POC_STAT0_IN4IF                      BIT(4)                                  /*!< POC_IN4 input interrupt flag */
#define POC_STAT0_IN5IF                      BIT(5)                                  /*!< POC_IN5 input interrupt flag */
#define POC_STAT0_HXTALSDF                   BIT(8)                                  /*!< HXTAL stuck detection flag */
#define POC_STAT0_LOCKUPDF                   BIT(9)                                  /*!< CPU LOCKUP detection flag */
#define POC_STAT0_TIMER0_CCIF                BIT(16)                                 /*!< TIMER0 concurrent conduction interrupt flag */
#define POC_STAT0_TIMER7_CCIF                BIT(17)                                 /*!< TIMER7 concurrent conduction interrupt flag */

/* POC_INnDCFG (n=0..5) */
#define POC_INnDCFG_INDMSEL                   BITS(0,3)                              /*!< POC_INn input detection mode selection */
#define POC_INnDCFG_INDSNUM                   BITS(4,7)                              /*!< POC_INn input detection sampling numbert */
#define POC_INnDCFG_INIE                      BIT(8)                                 /*!< POC_INn input interrupt enable */
#define POC_INnDCFG_INDREN                    BIT(9)                                 /*!< POC_INn disabling request enable */
#define POC_INnDCFG_INPL                      BIT(15)                                /*!< Polarity of POC_INn pin input */

/* POC_CTL0 */
#define POC_CTL0_HXTALS_DREN                  BIT(0)                                 /*!< HXTAL stuck disabling request enable */
#define POC_CTL0_LOCKUP_DREN                  BIT(1)                                 /*!< CPU LOCKUP disabling request enable */

/* POC_SWDRG */
#define POC_SWDRG_TIMER0_SWDRG                 BIT(0)                                /*!< software generates the disabling request for TIMER0 */
#define POC_SWDRG_TIMER7_SWDRG                 BIT(1)                                /*!< software generates the disabling request for TIMER7 */
#define POC_SWDRG_TIMER1_SWDRG                 BIT(2)                                /*!< software generates the disabling request for TIMER1 */
#define POC_SWDRG_TIMER2_SWDRG                 BIT(3)                                /*!< software generates the disabling request for TIMER2 */
#define POC_SWDRG_GPTIMER0_SWDRG               BIT(4)                                /*!< software generates the disabling request for GPTIMER0 */
#define POC_SWDRG_GPTIMER1_SWDRG               BIT(5)                                /*!< software generates the disabling request for GPTIMER1 */

/* POC_CDCFG0 */
#define POC_CDCFG0_TIMER0_CH0_APSEL            BIT(0)                                /*!< TIMER0_CH0 active polarity selection */
#define POC_CDCFG0_TIMER0_MCH0_APSEL           BIT(1)                                /*!< TIMER0_MCH0 active polarity selection */
#define POC_CDCFG0_TIMER0_CH1_APSEL            BIT(2)                                /*!< TIMER0_CH1 active polarity selection */
#define POC_CDCFG0_TIMER0_MCH1_APSEL           BIT(3)                                /*!< TIMER0_MCH1 active polarity selection */
#define POC_CDCFG0_TIMER0_CH2_APSEL            BIT(4)                                /*!< TIMER0_CH2 active polarity selection */
#define POC_CDCFG0_TIMER0_MCH2_APSEL           BIT(5)                                /*!< TIMER0_MCH2 active polarity selection */
#define POC_CDCFG0_TIMER0_PSELEN               BIT(7)                                /*!< TIMER0 polarity selection enable */
#define POC_CDCFG0_TIMER0_CCIE                 BIT(8)                                /*!< TIMER0 concurrent conduction interrupt enable */
#define POC_CDCFG0_TIMER0_CCDREN               BIT(9)                                /*!< TIMER0 concurrent conduction disabling request enable */

/* POC_CDCFG1 */
#define POC_CDCFG1_TIMER7_CH0_APSEL            BIT(0)                                /*!< TIMER7_CH0 active polarity selection */
#define POC_CDCFG1_TIMER7_MCH0_APSEL           BIT(1)                                /*!< TIMER7_MCH0 active polarity selection */
#define POC_CDCFG1_TIMER7_CH1_APSEL            BIT(2)                                /*!< TIMER7_CH1 active polarity selection */
#define POC_CDCFG1_TIMER7_MCH1_APSEL           BIT(3)                                /*!< TIMER7_MCH1 active polarity selection */
#define POC_CDCFG1_TIMER7_CH2_APSEL            BIT(4)                                /*!< TIMER7_CH2 active polarity selection */
#define POC_CDCFG1_TIMER7_MCH2_APSEL           BIT(5)                                /*!< TIMER7_MCH2 active polarity selection */
#define POC_CDCFG1_TIMER7_PSELEN               BIT(7)                                /*!< TIMER7 polarity selection enable */
#define POC_CDCFG1_TIMER7_CCIE                 BIT(8)                                /*!< TIMER7 concurrent conduction interrupt enable */
#define POC_CDCFG1_TIMER7_CCDREN               BIT(9)                                /*!< TIMER7 concurrent conduction disabling request enable */

/* POC_ODMODE0 */
#define POC_ODMODE0_TIMER0_OSEL0               BITS(0,1)                             /*!< Output selection for TIMER0_CH0/ TIMER0_MCH0 pin */
#define POC_ODMODE0_TIMER0_OSEL1               BITS(2,3)                             /*!< Output selection for TIMER0_CH1/ TIMER0_MCH1 pin */
#define POC_ODMODE0_TIMER0_OSEL2               BITS(4,5)                             /*!< Output selection for TIMER0_CH2/ TIMER0_MCH2 pin */
#define POC_ODMODE0_TIMER0_OSEL3               BITS(6,7)                             /*!< Output selection for TIMER0_CH3/ TIMER0_MCH3 pin */
#define POC_ODMODE0_TIMER7_OSEL0               BITS(8,9)                             /*!< Output selection for TIMER7_CH0/ TIMER7_MCH0 pin */
#define POC_ODMODE0_TIMER7_OSEL1               BITS(10,11)                           /*!< Output selection for TIMER7_CH1/ TIMER7_MCH1 pin */
#define POC_ODMODE0_TIMER7_OSEL2               BITS(12,13)                           /*!< Output selection for TIMER7_CH2/ TIMER7_MCH2 pin */
#define POC_ODMODE0_TIMER7_OSEL3               BITS(14,15)                           /*!< Output selection for TIMER7_CH3/ TIMER7_MCH3 pin */

