burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_poc.h
/* POC_ODMODE1 */
#define POC_ODMODE1_TIMER1_OSEL0               BITS(0,1)                             /*!< Output selection for TIMER1_CH0 pin */
#define POC_ODMODE1_TIMER1_OSEL1               BITS(2,3)                             /*!< Output selection for TIMER1_CH1 pin */
#define POC_ODMODE1_TIMER1_OSEL2               BITS(4,5)                             /*!< Output selection for TIMER1_CH2 pin */
#define POC_ODMODE1_TIMER1_OSEL3               BITS(6,7)                             /*!< Output selection for TIMER1_CH3 pin */
#define POC_ODMODE1_TIMER2_OSEL0               BITS(8,9)                             /*!< Output selection for TIMER2_CH0 pin */
#define POC_ODMODE1_TIMER2_OSEL1               BITS(10,11)                           /*!< Output selection for TIMER2_CH1 pin */
#define POC_ODMODE1_TIMER2_OSEL2               BITS(12,13)                           /*!< Output selection for TIMER2_CH2 pin */
#define POC_ODMODE1_TIMER2_OSEL3               BITS(14,15)                           /*!< Output selection for TIMER2_CH3 pin */
#define POC_ODMODE1_GPTIMER0_OSEL0             BITS(16,17)                           /*!< Output selection for GPTIMER0_CH0 pin */
#define POC_ODMODE1_GPTIMER0_OSEL1             BITS(18,19)                           /*!< Output selection for GPTIMER0_CH1 pin */
#define POC_ODMODE1_GPTIMER1_OSEL0             BITS(24,25)                           /*!< Output selection for GPTIMER1_CH0 pin */
#define POC_ODMODE1_GPTIMER1_OSEL1             BITS(26,27)                           /*!< Output selection for GPTIMER1_CH1 pin */

/* POC_REQSEL0 */
#define POC_REQSEL0_TIMER0_IN0DRSEL            BIT(0)                                /*!< POC_IN0 disabling request select TIMER0 */
#define POC_REQSEL0_TIMER0_IN1DRSEL            BIT(1)                                /*!< POC_IN1 disabling request select TIMER0 */
#define POC_REQSEL0_TIMER0_IN2DRSEL            BIT(2)                                /*!< POC_IN2 disabling request select TIMER0 */
#define POC_REQSEL0_TIMER0_IN3DRSEL            BIT(3)                                /*!< POC_IN3 disabling request select TIMER0 */
#define POC_REQSEL0_TIMER0_IN4DRSEL            BIT(4)                                /*!< POC_IN4 disabling request select TIMER0 */
#define POC_REQSEL0_TIMER0_IN5DRSEL            BIT(5)                                /*!< POC_IN5 disabling request select TIMER0 */
#define POC_REQSEL0_TIMER0_CMPDRSEL            BIT(6)                                /*!< CMPn (n=0,1,2,3) disabling request select TIMER0 */
#define POC_REQSEL0_TIMER7_IN0DRSEL            BIT(8)                                /*!< POC_IN0 disabling request select TIMER7 */
#define POC_REQSEL0_TIMER7_IN1DRSEL            BIT(9)                                /*!< POC_IN1 disabling request select TIMER7 */
#define POC_REQSEL0_TIMER7_IN2DRSEL            BIT(10)                               /*!< POC_IN2 disabling request select TIMER7 */
#define POC_REQSEL0_TIMER7_IN3DRSEL            BIT(11)                               /*!< POC_IN3 disabling request select TIMER7 */
#define POC_REQSEL0_TIMER7_IN4DRSEL            BIT(12)                               /*!< POC_IN4 disabling request select TIMER7 */
#define POC_REQSEL0_TIMER7_IN5DRSEL            BIT(13)                               /*!< POC_IN5 disabling request select TIMER7 */
#define POC_REQSEL0_TIMER7_CMPDRSEL            BIT(14)                               /*!< CMPn (n=0,1,2,3) disabling request select TIMER7 */

/* POC_REQSEL1 */
#define POC_REQSEL1_TIMER1_IN0DRSEL            BIT(0)                                /*!< POC_IN0 disabling request select TIMER1 */
#define POC_REQSEL1_TIMER1_IN1DRSEL            BIT(1)                                /*!< POC_IN1 disabling request select TIMER1 */
#define POC_REQSEL1_TIMER1_IN2DRSEL            BIT(2)                                /*!< POC_IN2 disabling request select TIMER1 */
#define POC_REQSEL1_TIMER1_IN3DRSEL            BIT(3)                                /*!< POC_IN3 disabling request select TIMER1 */
#define POC_REQSEL1_TIMER1_IN4DRSEL            BIT(4)                                /*!< POC_IN4 disabling request select TIMER1 */
#define POC_REQSEL1_TIMER1_IN5DRSEL            BIT(5)                                /*!< POC_IN5 disabling request select TIMER1 */
#define POC_REQSEL1_TIMER1_CMPDRSEL            BIT(6)                                /*!< CMPn (n=0,1,2,3) disabling request select TIMER1 */
#define POC_REQSEL1_TIMER2_IN0DRSEL            BIT(8)                                /*!< POC_IN0 disabling request select TIMER2 */
#define POC_REQSEL1_TIMER2_IN1DRSEL            BIT(9)                                /*!< POC_IN1 disabling request select TIMER2 */
#define POC_REQSEL1_TIMER2_IN2DRSEL            BIT(10)                               /*!< POC_IN2 disabling request select TIMER2 */
#define POC_REQSEL1_TIMER2_IN3DRSEL            BIT(11)                               /*!< POC_IN3 disabling request select TIMER2 */
#define POC_REQSEL1_TIMER2_IN4DRSEL            BIT(12)                               /*!< POC_IN4 disabling request select TIMER2 */
#define POC_REQSEL1_TIMER2_IN5DRSEL            BIT(13)                               /*!< POC_IN5 disabling request select TIMER2 */
#define POC_REQSEL1_TIMER2_CMPDRSEL            BIT(14)                               /*!< CMPn (n=0,1,2,3) disabling request select TIMER2 */
#define POC_REQSEL1_GPTIMER0_IN0DRSEL          BIT(16)                               /*!< POC_IN0 disabling request select GPTIMER0 */
#define POC_REQSEL1_GPTIMER0_IN1DRSEL          BIT(17)                               /*!< POC_IN1 disabling request select GPTIMER0 */
#define POC_REQSEL1_GPTIMER0_IN2DRSEL          BIT(18)                               /*!< POC_IN2 disabling request select GPTIMER0 */
#define POC_REQSEL1_GPTIMER0_IN3DRSEL          BIT(19)                               /*!< POC_IN3 disabling request select GPTIMER0 */
#define POC_REQSEL1_GPTIMER0_IN4DRSEL          BIT(20)                               /*!< POC_IN4 disabling request select GPTIMER0 */
#define POC_REQSEL1_GPTIMER0_IN5DRSEL          BIT(21)                               /*!< POC_IN5 disabling request select GPTIMER0 */
#define POC_REQSEL1_GPTIMER0_CMPDRSEL          BIT(22)                               /*!< CMPn (n=0,1,2,3) disabling request select GPTIMER0 */
#define POC_REQSEL1_GPTIMER1_IN0DRSEL          BIT(24)                               /*!< POC_IN0 disabling request select GPTIMER1 */
#define POC_REQSEL1_GPTIMER1_IN1DRSEL          BIT(25)                               /*!< POC_IN1 disabling request select GPTIMER1 */
#define POC_REQSEL1_GPTIMER1_IN2DRSEL          BIT(26)                               /*!< POC_IN2 disabling request select GPTIMER1 */
#define POC_REQSEL1_GPTIMER1_IN3DRSEL          BIT(27)                               /*!< POC_IN3 disabling request select GPTIMER1 */
#define POC_REQSEL1_GPTIMER1_IN4DRSEL          BIT(28)                               /*!< POC_IN4 disabling request select GPTIMER1 */
#define POC_REQSEL1_GPTIMER1_IN5DRSEL          BIT(29)                               /*!< POC_IN5 disabling request select GPTIMER1 */
#define POC_REQSEL1_GPTIMER1_CMPDRSEL          BIT(30)                               /*!< CMPn (n=0,1,2,3) disabling request select GPTIMER1 */

/* POC_STAT1 */
#define POC_STAT1_CMP0DF                       BIT(0)                                /*!< comparator 0 detection flag */
#define POC_STAT1_CMP1DF                       BIT(1)                                /*!< comparator 1 detection flag */
#define POC_STAT1_CMP2DF                       BIT(2)                                /*!< comparator 2 detection flag */
#define POC_STAT1_CMP3DF                       BIT(3)                                /*!< comparator 3 detection flag */

/* POC_CTL1 */
#define POC_CTL1_CMP0DREN                     BIT(0)                                 /*!< comparator 0 disabling request enable */
#define POC_CTL1_CMP1DREN                     BIT(1)                                 /*!< comparator 1 disabling request enable */
#define POC_CTL1_CMP2DREN                     BIT(2)                                 /*!< comparator 2 disabling request enable */
#define POC_CTL1_CMP3DREN                     BIT(3)                                 /*!< comparator 3 disabling request enable */

/* POC_EXTCTL0 */
#define POC_EXTCTL0_TIMER0_CMP0DREN           BIT(0)                                 /*!< comparator 0 disabling request enable for TIMER0 */
#define POC_EXTCTL0_TIMER0_CMP1DREN           BIT(1)                                 /*!< comparator 1 disabling request enable for TIMER0 */
#define POC_EXTCTL0_TIMER0_CMP2DREN           BIT(2)                                 /*!< comparator 2 disabling request enable for TIMER0 */
#define POC_EXTCTL0_TIMER0_CMP3DREN           BIT(3)                                 /*!< comparator 3 disabling request enable for TIMER0 */
#define POC_EXTCTL0_TIMER7_CMP0DREN           BIT(8)                                 /*!< comparator 0 disabling request enable for TIMER7 */
#define POC_EXTCTL0_TIMER7_CMP1DREN           BIT(9)                                 /*!< comparator 1 disabling request enable for TIMER7 */
#define POC_EXTCTL0_TIMER7_CMP2DREN           BIT(10)                                /*!< comparator 2 disabling request enable for TIMER7 */
#define POC_EXTCTL0_TIMER7_CMP3DREN           BIT(11)                                /*!< comparator 3 disabling request enable for TIMER7 */

/* POC_EXTCTL1 */
#define POC_EXTCTL1_TIMER1_CMP0DREN           BIT(0)                                 /*!< comparator 0 disabling request enable for TIMER1 */
#define POC_EXTCTL1_TIMER1_CMP1DREN           BIT(1)                                 /*!< comparator 1 disabling request enable for TIMER1 */
#define POC_EXTCTL1_TIMER1_CMP2DREN           BIT(2)                                 /*!< comparator 2 disabling request enable for TIMER1 */
#define POC_EXTCTL1_TIMER1_CMP3DREN           BIT(3)                                 /*!< comparator 3 disabling request enable for TIMER1 */
#define POC_EXTCTL1_TIMER2_CMP0DREN           BIT(8)                                 /*!< comparator 0 disabling request enable for TIMER2 */
#define POC_EXTCTL1_TIMER2_CMP1DREN           BIT(9)                                 /*!< comparator 1 disabling request enable for TIMER2 */
#define POC_EXTCTL1_TIMER2_CMP2DREN           BIT(10)                                /*!< comparator 2 disabling request enable for TIMER2 */
#define POC_EXTCTL1_TIMER2_CMP3DREN           BIT(11)                                /*!< comparator 3 disabling request enable for TIMER2 */
#define POC_EXTCTL1_GPTIMER0_CMP0DREN         BIT(16)                                /*!< comparator 0 disabling request enable for GPTIMER0 */
#define POC_EXTCTL1_GPTIMER0_CMP1DREN         BIT(17)                                /*!< comparator 1 disabling request enable for GPTIMER0 */
#define POC_EXTCTL1_GPTIMER0_CMP2DREN         BIT(18)                                /*!< comparator 2 disabling request enable for GPTIMER0 */
#define POC_EXTCTL1_GPTIMER0_CMP3DREN         BIT(19)                                /*!< comparator 3 disabling request enable for GPTIMER0 */
#define POC_EXTCTL1_GPTIMER1_CMP0DREN         BIT(24)                                /*!< comparator 0 disabling request enable for GPTIMER1 */
#define POC_EXTCTL1_GPTIMER1_CMP1DREN         BIT(25)                                /*!< comparator 1 disabling request enable for GPTIMER1 */
#define POC_EXTCTL1_GPTIMER1_CMP2DREN         BIT(26)                                /*!< comparator 2 disabling request enable for GPTIMER1 */
#define POC_EXTCTL1_GPTIMER1_CMP3DREN         BIT(27)                                /*!< comparator 3 disabling request enable for GPTIMER1 */

