burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_poc.h
/* POC_INnDMK (n=0..5) */
#define POC_INnDMK_INMKSEL                    BITS(0,4)                              /*!< POC_INn input detection mask selection */

/* POC_CMPnDMK (n=0..3) */
#define POC_CMPnDMK_CMPMKSEL                 BITS(0,4)                               /*!< Comparator n output detection mask selection */

/* constants definitions */
/* disabling request source */
typedef struct {
    uint8_t req_pocin0;                                                              /*!< request from POC_IN0 pin input detection */
    uint8_t req_pocin1;                                                              /*!< request from POC_IN1 pin input detection */
    uint8_t req_pocin2;                                                              /*!< request from POC_IN2 pin input detection */
    uint8_t req_pocin3;                                                              /*!< request from POC_IN3 pin input detection */
    uint8_t req_pocin4;                                                              /*!< request from POC_IN4 pin input detection */
    uint8_t req_pocin5;                                                              /*!< request from POC_IN5 pin input detection */
    uint8_t req_comparator;                                                          /*!< request from comparator output detection */
} poc_request_struct;

/* POC input pin */
typedef enum {
    POC_IN0 = 0,                                                                     /*!< POC_IN0 input pin */
    POC_IN1,                                                                         /*!< POC_IN1 input pin */
    POC_IN2,                                                                         /*!< POC_IN2 input pin */
    POC_IN3,                                                                         /*!< POC_IN3 input pin */
    POC_IN4,                                                                         /*!< POC_IN4 input pin */
    POC_IN5                                                                          /*!< POC_IN5 input pin */
} poc_pin_enum;

/* comparator output */
typedef enum {
    CMP0_OUT = 0,                                                                    /*!< comparator 0 output */
    CMP1_OUT,                                                                        /*!< comparator 1 output */
    CMP2_OUT,                                                                        /*!< comparator 2 output */
    CMP3_OUT                                                                         /*!< comparator 3 output */
} cmp_output_enum;

/* poc target timer */
typedef enum {
    TARGET_TIMER0 = 0,                                                               /*!< TIMER0 */
    TARGET_TIMER7,                                                                   /*!< TIMER7 */
    TARGET_TIMER1,                                                                   /*!< TIMER1 */
    TARGET_TIMER2,                                                                   /*!< TIMER2 */
    TARGET_GPTIMER0,                                                                 /*!< GPTIMER0 */
    TARGET_GPTIMER1                                                                  /*!< GPTIMER1 */
} target_timer_enum;

/* poc interrupt */
typedef enum {
    POC_INT_IN0 = 0,                                                                 /*!< POC_IN0 input detection interrupt */
    POC_INT_IN1,                                                                     /*!< POC_IN1 input detection interrupt */
    POC_INT_IN2,                                                                     /*!< POC_IN2 input detection interrupt */
    POC_INT_IN3,                                                                     /*!< POC_IN3 input detection interrupt */
    POC_INT_IN4,                                                                     /*!< POC_IN4 input detection interrupt */
    POC_INT_IN5,                                                                     /*!< POC_IN5 input detection interrupt */
    POC_INT_TIMER0CC,                                                                /*!< TIMER0 concurrent conduction detection interrupt */
    POC_INT_TIMER7CC                                                                 /*!< TIMER7 concurrent conduction detection interrupt */
} poc_interrupt_enum;

/* poc timer complementary detection struct definitions */
typedef struct {
    uint32_t ccdreqstatus;                                                           /*!< concurrent conduction disabling request status */
    uint32_t polarityselen;                                                          /*!< timer polarity selection enable  */
    uint32_t mch2polarity;                                                           /*!< multi mode channel 2 active polarity selection */
    uint32_t ch2polarity;                                                            /*!< channel 2 active polarity selection */
    uint32_t mch1polarity;                                                           /*!< multi mode channel 1 active polarity selection */
    uint32_t ch1polarity;                                                            /*!< channel 1 active polarity selection */
    uint32_t mch0polarity;                                                           /*!< multi mode channel 0 active polarity selection */
    uint32_t ch0polarity;                                                            /*!< channel 0 active polarity selection */
} poc_complementary_detection_struct;

/* POC_INn input detection mode */
#define INnDCFG_INDMSEL(regval)               (BITS(0,3) & ((uint32_t)(regval) << 0))
#define POC_EDGE_DETECTION_DIV1               INnDCFG_INDMSEL(0)                     /*!< Sampling frequency is fHCLK and generate a request on the falling edge (INPL=0) or rising edge (INPL=1) */
#define POC_LEVEL_DETECTION_DIV8              INnDCFG_INDMSEL(1)                     /*!< Sampling frequency is fHCLK/8 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV16             INnDCFG_INDMSEL(2)                     /*!< Sampling frequency is fHCLK/16 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV128            INnDCFG_INDMSEL(3)                     /*!< Sampling frequency is fHCLK/128 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV1              INnDCFG_INDMSEL(4)                     /*!< Sampling frequency is fHCLK and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV2              INnDCFG_INDMSEL(5)                     /*!< Sampling frequency is fHCLK/2 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV4              INnDCFG_INDMSEL(6)                     /*!< Sampling frequency is fHCLK/4 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV256            INnDCFG_INDMSEL(7)                     /*!< Sampling frequency is fHCLK/256 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV512            INnDCFG_INDMSEL(8)                     /*!< Sampling frequency is fHCLK/512 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV32             INnDCFG_INDMSEL(9)                     /*!< Sampling frequency is fHCLK/32 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_LEVEL_DETECTION_DIV64             INnDCFG_INDMSEL(10)                    /*!< Sampling frequency is fHCLK/64 and generate a request when the low level (INPL=0) or high level (INPL=1) is continuously sampled a certain number of times */
#define POC_EDGE_DETECTION_DIV2               INnDCFG_INDMSEL(11)                    /*!< Sampling frequency is fHCLK/2 and generate a request on the falling edge (INPL=0) or rising edge (INPL=1) */
#define POC_EDGE_DETECTION_DIV4               INnDCFG_INDMSEL(12)                    /*!< Sampling frequency is fHCLK/4 and generate a request on the falling edge (INPL=0) or rising edge (INPL=1) */

/* POC_INn input detection sampling number */
#define INnDCFG_INDSNUM(regval)               (BITS(4,7) & ((uint32_t)(regval) << 4))
#define POC_SAMPLING_NUM_16_TIMES             INnDCFG_INDSNUM(0)                     /*!< sampling number is 16 times */
#define POC_SAMPLING_NUM_4_TIMES              INnDCFG_INDSNUM(1)                     /*!< sampling number is 4 times */
#define POC_SAMPLING_NUM_8_TIMES              INnDCFG_INDSNUM(2)                     /*!< sampling number is 8 times */
#define POC_SAMPLING_NUM_9_TIMES              INnDCFG_INDSNUM(3)                     /*!< sampling number is 9 times */
#define POC_SAMPLING_NUM_10_TIMES             INnDCFG_INDSNUM(4)                     /*!< sampling number is 10 times */
#define POC_SAMPLING_NUM_11_TIMES             INnDCFG_INDSNUM(5)                     /*!< sampling number is 11 times */
#define POC_SAMPLING_NUM_12_TIMES             INnDCFG_INDSNUM(6)                     /*!< sampling number is 12 times */
#define POC_SAMPLING_NUM_13_TIMES             INnDCFG_INDSNUM(7)                     /*!< sampling number is 13 times */
#define POC_SAMPLING_NUM_14_TIMES             INnDCFG_INDSNUM(8)                     /*!< sampling number is 14 times */
#define POC_SAMPLING_NUM_15_TIMES             INnDCFG_INDSNUM(9)                     /*!< sampling number is 15 times */

/* output disable mode */
#define POC_TIMER_CHANNEL_OUT                 ((uint8_t)0x00U)                       /*!< timer channel output */
#define POC_HIGH_IMPEDANCE_OUT                ((uint8_t)0x01U)                       /*!< High-impedance output */
#define POC_GPIO_OUT                          ((uint8_t)0x02U)                       /*!< GPIO output */

/* polarity of POC_INn input */
#define INnDCFG_INPL(regval)                  (BIT(15) & ((uint32_t)(regval) << 15U))
#define POC_INPUT_POLARITY_NONINVERTED        INnDCFG_INPL(0)                        /*!< POC_INn input not inverted */
#define POC_INPUT_POLARITY_INVERTED           INnDCFG_INPL(1)                        /*!< POC_INn input inverted */

/* POC_INn disabling request status */
#define INnDCFG_INDREN(regval)                (BIT(9) & ((uint32_t)(regval) << 9U))
#define POC_INn_DREQ_DISABLE                  INnDCFG_INDREN(0)                      /*!< POC_INn disabling request disable */
#define POC_INn_DREQ_ENABLE                   INnDCFG_INDREN(1)                      /*!< POC_INn disabling request enable */

/* HXTAL stuck disabling request status */
#define CTL0_HXTALS_DREN(regval)              (BIT(0) & ((uint32_t)(regval) << 0U))
#define HXTALS_DREQ_DISABLE                   CTL0_HXTALS_DREN(0)                    /*!< HXTAL stuck disabling request disable */
#define HXTALS_DREQ_ENABLE                    CTL0_HXTALS_DREN(1)                    /*!< HXTAL stuck disabling request enable */

/* CPU LOCKUP disabling request status */
#define CTL0_LOCKUP_DREN(regval)              (BIT(1) & ((uint32_t)(regval) << 1U))
#define LOCKUP_DREQ_DISABLE                   CTL0_LOCKUP_DREN(0)                    /*!< CPU LOCKUP disabling request disable */
#define LOCKUP_DREQ_ENABLE                    CTL0_LOCKUP_DREN(1)                    /*!< CPU LOCKUP disabling request enable */

/* TIMER concurrent conduction disabling request status */
#define CDCFG_TIMER_CCDREN(regval)            (BIT(9) & ((uint32_t)(regval) << 9U))
#define TIMER_CCDREQ_DISABLE                   CDCFG_TIMER_CCDREN(0)                 /*!< TIMER concurrent conduction disabling request disable */
#define TIMER_CCDREQ_ENABLE                    CDCFG_TIMER_CCDREN(1)                 /*!< TIMER concurrent conduction disabling request enable */

