burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_poc.h
/* TIMER polarity selection enable */
#define CDCFG_TIMER_PSELEN(regval)            (BIT(7) & ((uint32_t)(regval) << 7U))
#define TIMER_POLARITY_SELECTION_DISABLE       CDCFG_TIMER_PSELEN(0)                 /*!< TIMER polarity selection is enabled */
#define TIMER_POLARITY_SELECTION_ENABLE        CDCFG_TIMER_PSELEN(1)                 /*!< TIMER polarity selection is disabled */

/* multi mode channel 2 active polarity */
#define CDCFG_MCH2_APSEL(regval)              (BIT(5) & ((uint32_t)(regval) << 5U))
#define MCH2_POLARITY_HIGH                     CDCFG_MCH2_APSEL(0)                   /*!< multi mode channel 2 active polarity is high*/
#define MCH2_POLARITY_LOW                      CDCFG_MCH2_APSEL(1)                   /*!< multi mode channel 2 active polarity is low */

/* channel 2 active polarity */
#define CDCFG_CH2_APSEL(regval)              (BIT(4) & ((uint32_t)(regval) << 4U))
#define CH2_POLARITY_HIGH                     CDCFG_CH2_APSEL(0)                     /*!< channel 2 active polarity is high*/
#define CH2_POLARITY_LOW                      CDCFG_CH2_APSEL(1)                     /*!< channel 2 active polarity is low */

/* multi mode channel 1 active polarity */
#define CDCFG_MCH1_APSEL(regval)              (BIT(3) & ((uint32_t)(regval) << 3U))
#define MCH1_POLARITY_HIGH                     CDCFG_MCH1_APSEL(0)                   /*!< multi mode channel 1 active polarity is high*/
#define MCH1_POLARITY_LOW                      CDCFG_MCH1_APSEL(1)                   /*!< multi mode channel 1 active polarity is low */

/* channel 1 active polarity */
#define CDCFG_CH1_APSEL(regval)              (BIT(2) & ((uint32_t)(regval) << 2U))
#define CH1_POLARITY_HIGH                     CDCFG_CH1_APSEL(0)                     /*!< channel 1 active polarity is high*/
#define CH1_POLARITY_LOW                      CDCFG_CH1_APSEL(1)                     /*!< channel 1 active polarity is low */

/* multi mode channel 0 active polarity */
#define CDCFG_MCH0_APSEL(regval)              (BIT(1) & ((uint32_t)(regval) << 1U))
#define MCH0_POLARITY_HIGH                     CDCFG_MCH0_APSEL(0)                   /*!< multi mode channel 0 active polarity is high*/
#define MCH0_POLARITY_LOW                      CDCFG_MCH0_APSEL(1)                   /*!< multi mode channel 0 active polarity is low */

/* channel 0 active polarity */
#define CDCFG_CH0_APSEL(regval)              (BIT(0) & ((uint32_t)(regval) << 0U))
#define CH0_POLARITY_HIGH                     CDCFG_CH0_APSEL(0)                     /*!< channel 0 active polarity is high*/
#define CH0_POLARITY_LOW                      CDCFG_CH0_APSEL(1)                     /*!< channel 0 active polarity is low */

/* request select target timer */
#define TARGET_TIMER_NOT_SELECTED            ((uint8_t)0x00U)                        /*!< target timer is not selected */
#define TARGET_TIMER_SELECTED                ((uint8_t)0x01U)                        /*!< target timer is selected */

/* comparator 0 disabling request status */
#define CTL1_CMP0DREN(regval)                  (BIT(0) & ((uint32_t)(regval) << 0U))
#define CMP0_DREQ_DISABLE                      CTL1_CMP0DREN(0)                      /*!< comparator 0 disabling request disable */
#define CMP0_DREQ_ENABLE                       CTL1_CMP0DREN(1)                      /*!< comparator 0 disabling request enable */

/* comparator 1 disabling request status */
#define CTL1_CMP1DREN(regval)                  (BIT(1) & ((uint32_t)(regval) << 1U))
#define CMP1_DREQ_DISABLE                      CTL1_CMP1DREN(0)                      /*!< comparator 1 disabling request disable */
#define CMP1_DREQ_ENABLE                       CTL1_CMP1DREN(1)                      /*!< comparator 1 disabling request enable */

/* comparator 2 disabling request status */
#define CTL1_CMP2DREN(regval)                  (BIT(2) & ((uint32_t)(regval) << 2U))
#define CMP2_DREQ_DISABLE                      CTL1_CMP2DREN(0)                      /*!< comparator 2 disabling request disable */
#define CMP2_DREQ_ENABLE                       CTL1_CMP2DREN(1)                      /*!< comparator 2 disabling request enable */

/* comparator 3 disabling request status */
#define CTL1_CMP3DREN(regval)                  (BIT(3) & ((uint32_t)(regval) << 3U))
#define CMP3_DREQ_DISABLE                      CTL1_CMP3DREN(0)                      /*!< comparator 3 disabling request disable */
#define CMP3_DREQ_ENABLE                       CTL1_CMP3DREN(1)                      /*!< comparator 3 disabling request enable */

/* detection mask source selection */
#define DMK_MKSEL(regval)                    (BITS(0, 4) & ((uint32_t)(regval) << 0U))
#define POC_REQUEST_NOT_MASKED                DMK_MKSEL(0)                           /*!< detection is not masked */
#define POC_MASK_SOURCE_TIMER0_CH0            DMK_MKSEL(1)                           /*!< detection is masked by TIMER0_CH0 */
#define POC_MASK_SOURCE_TIMER0_CH1            DMK_MKSEL(2)                           /*!< detection is masked by TIMER0_CH1 */
#define POC_MASK_SOURCE_TIMER0_CH2            DMK_MKSEL(3)                           /*!< detection is masked by TIMER0_CH2 */
#define POC_MASK_SOURCE_TIMER0_CH3            DMK_MKSEL(4)                           /*!< detection is masked by TIMER0_CH3 */
#define POC_MASK_SOURCE_TIMER0_MCH0           DMK_MKSEL(5)                           /*!< detection is masked by TIMER0_MCH0 */
#define POC_MASK_SOURCE_TIMER0_MCH1           DMK_MKSEL(6)                           /*!< detection is masked by TIMER0_MCH1 */
#define POC_MASK_SOURCE_TIMER0_MCH2           DMK_MKSEL(7)                           /*!< detection is masked by TIMER0_MCH2 */
#define POC_MASK_SOURCE_TIMER0_MCH3           DMK_MKSEL(8)                           /*!< detection is masked by TIMER0_MCH3 */
#define POC_MASK_SOURCE_TIMER7_CH0            DMK_MKSEL(9)                           /*!< detection is masked by TIMER7_CH0 */
#define POC_MASK_SOURCE_TIMER7_CH1            DMK_MKSEL(10)                          /*!< detection is masked by TIMER7_CH1 */
#define POC_MASK_SOURCE_TIMER7_CH2            DMK_MKSEL(11)                          /*!< detection is masked by TIMER7_CH2 */
#define POC_MASK_SOURCE_TIMER7_CH3            DMK_MKSEL(12)                          /*!< detection is masked by TIMER7_CH3 */
#define POC_MASK_SOURCE_TIMER7_MCH0           DMK_MKSEL(13)                          /*!< detection is masked by TIMER7_MCH0 */
#define POC_MASK_SOURCE_TIMER7_MCH1           DMK_MKSEL(14)                          /*!< detection is masked by TIMER7_MCH1 */
#define POC_MASK_SOURCE_TIMER7_MCH2           DMK_MKSEL(15)                          /*!< detection is masked by TIMER7_MCH2 */
#define POC_MASK_SOURCE_TIMER7_MCH3           DMK_MKSEL(16)                          /*!< detection is masked by TIMER7_MCH3 */
#define POC_MASK_SOURCE_TIMER1_CH0            DMK_MKSEL(17)                          /*!< detection is masked by TIMER1_CH0 */
#define POC_MASK_SOURCE_TIMER1_CH1            DMK_MKSEL(18)                          /*!< detection is masked by TIMER1_CH1 */
#define POC_MASK_SOURCE_TIMER1_CH2            DMK_MKSEL(19)                          /*!< detection is masked by TIMER1_CH2 */
#define POC_MASK_SOURCE_TIMER1_CH3            DMK_MKSEL(20)                          /*!< detection is masked by TIMER1_CH3 */
#define POC_MASK_SOURCE_TIMER2_CH0            DMK_MKSEL(21)                          /*!< detection is masked by TIMER2_CH0 */
#define POC_MASK_SOURCE_TIMER2_CH1            DMK_MKSEL(22)                          /*!< detection is masked by TIMER2_CH1 */
#define POC_MASK_SOURCE_TIMER2_CH2            DMK_MKSEL(23)                          /*!< detection is masked by TIMER2_CH2 */
#define POC_MASK_SOURCE_TIMER2_CH3            DMK_MKSEL(24)                          /*!< detection is masked by TIMER2_CH3 */
#define POC_MASK_SOURCE_GPTIMER0_CH0          DMK_MKSEL(25)                          /*!< detection is masked by GPTIMER0_CH0 */
#define POC_MASK_SOURCE_GPTIMER0_CH1          DMK_MKSEL(26)                          /*!< detection is masked by GPTIMER0_CH1 */
#define POC_MASK_SOURCE_GPTIMER1_CH0          DMK_MKSEL(27)                          /*!< detection is masked by GPTIMER1_CH0 */
#define POC_MASK_SOURCE_GPTIMER1_CH1          DMK_MKSEL(28)                          /*!< detection is masked by GPTIMER1_CH1 */

/* POC flags */
#define POC_FLAG_IN0IF                   POC_STAT0_IN0IF                             /*!< POC_IN0 input detection flag */
#define POC_FLAG_IN1IF                   POC_STAT0_IN1IF                             /*!< POC_IN1 input detection flag */
#define POC_FLAG_IN2IF                   POC_STAT0_IN2IF                             /*!< POC_IN2 input detection flag */
#define POC_FLAG_IN3IF                   POC_STAT0_IN3IF                             /*!< POC_IN3 input detection flag */
#define POC_FLAG_IN4IF                   POC_STAT0_IN4IF                             /*!< POC_IN4 input detection flag */
#define POC_FLAG_IN5IF                   POC_STAT0_IN5IF                             /*!< POC_IN5 input detection flag */
#define POC_FLAG_HXTALSDF                POC_STAT0_HXTALSDF                          /*!< HXTAL stuck detection flag */
#define POC_FLAG_LOCKUPDF                POC_STAT0_LOCKUPDF                          /*!< CPU LOCKUP detection flag */
#define POC_FLAG_TIMER0_CCIF             POC_STAT0_TIMER0_CCIF                       /*!< TIMER0 concurrent conduction flag */
#define POC_FLAG_TIMER7_CCIF             POC_STAT0_TIMER7_CCIF                       /*!< TIMER7 concurrent conduction flag */
#define POC_FLAG_CMP0DF                 (POC_STAT1_CMP0DF << 24U)                    /*!< comparator 0 detection flag */
#define POC_FLAG_CMP1DF                 (POC_STAT1_CMP1DF << 24U)                    /*!< comparator 1 detection flag */
#define POC_FLAG_CMP2DF                 (POC_STAT1_CMP2DF << 24U)                    /*!< comparator 2 detection flag */
#define POC_FLAG_CMP3DF                 (POC_STAT1_CMP3DF << 24U)                    /*!< comparator 3 detection flag */

