burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_poc.h
/* POC interrupt flags */
#define POC_INT_FLAG_IN0IF                   POC_STAT0_IN0IF                         /*!< POC_IN0 input interrupt flag */
#define POC_INT_FLAG_IN1IF                   POC_STAT0_IN1IF                         /*!< POC_IN1 input interrupt flag */
#define POC_INT_FLAG_IN2IF                   POC_STAT0_IN2IF                         /*!< POC_IN2 input interrupt flag */
#define POC_INT_FLAG_IN3IF                   POC_STAT0_IN3IF                         /*!< POC_IN3 input interrupt flag */
#define POC_INT_FLAG_IN4IF                   POC_STAT0_IN4IF                         /*!< POC_IN4 input interrupt flag */
#define POC_INT_FLAG_IN5IF                   POC_STAT0_IN5IF                         /*!< POC_IN5 input interrupt flag */
#define POC_INT_FLAG_TIMER0_CCIF             POC_STAT0_TIMER0_CCIF                   /*!< TIMER0 concurrent conduction interrupt flag */
#define POC_INT_FLAG_TIMER7_CCIF             POC_STAT0_TIMER7_CCIF                   /*!< TIMER7 concurrent conduction interrupt flag */

/* function declarations */
/* deinitialize POC */
void poc_deinit(void);
/* configure POC_INn input detection */
void poc_input_detection_config(poc_pin_enum poc_pin, uint32_t detection_mode, uint32_t sampling_number);
/* configure POC_INn disabling request status */
void poc_input_dreq_status_config(poc_pin_enum poc_pin, uint32_t indreq_status);
/* configure POC_INn input polarity */
void poc_input_polarity_config(poc_pin_enum poc_pin, uint32_t input_polarity);
/* configure system fault disabling request status */
void poc_sys_fault_dreq_status_config(uint32_t hxtalsdreq_status, uint32_t lockupdreq_status);
/* generate software disabling request for timer */
void poc_software_request_generate(target_timer_enum target_timer);
/* stop software disabling request for timer */
void poc_software_request_stop(target_timer_enum target_timer);
/* initialize POC complementary detection struct */
void poc_complementary_detection_struct_para_init(poc_complementary_detection_struct *detpara);
/* configure TIMER0 complementary channel detection */
void poc_timer0_complementary_detection_config(poc_complementary_detection_struct *detpara);
/* configure TIMER7 complementary channel detection */
void poc_timer7_complementary_detection_config(poc_complementary_detection_struct *detpara);

/* select output disable mode for TIMER0 */
void poc_timer0_output_disable_mode_select(uint8_t ch0mch0_pin_mode, uint8_t ch1mch1_pin_mode, uint8_t ch2mch2_pin_mode, uint8_t ch3mch3_pin_mode);
/* select output disable mode for TIMER7 */
void poc_timer7_output_disable_mode_select(uint8_t ch0mch0_pin_mode, uint8_t ch1mch1_pin_mode, uint8_t ch2mch2_pin_mode, uint8_t ch3mch3_pin_mode);
/* select output disable mode for TIMER1 */
void poc_timer1_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode, uint8_t ch2_pin_mode, uint8_t ch3_pin_mode);
/* select output disable mode for TIMER2 */
void poc_timer2_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode, uint8_t ch2_pin_mode, uint8_t ch3_pin_mode);
/* select output disable mode for GPTIMER0 */
void poc_gptimer0_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode);
/* select output disable mode for GPTIMER1 */
void poc_gptimer1_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode);

/* initialize POC request struct */
void poc_request_struct_para_init(poc_request_struct *request);
/* request select target timer */
void poc_request_select(poc_request_struct *request, target_timer_enum target_timer);

/* configure comparator disabling request status */
void poc_cmp_dreq_status_config(uint32_t cmp0dreq_status, uint32_t cmp1dreq_status, uint32_t cmp2dreq_status, uint32_t cmp3dreq_status);

/* configure comparator disabling request status for target timer */
void poc_cmp_dreq_status_extended_config(uint32_t cmp0dreq_status, uint32_t cmp1dreq_status, uint32_t cmp2dreq_status, uint32_t cmp3dreq_status,
                                         target_timer_enum target_timer);

/* mask POC_INn input detection */
void poc_input_detection_mask(poc_pin_enum poc_pin, uint32_t mask_source);

/* mask comparator output detection */
void poc_cmp_output_detection_mask(cmp_output_enum cmp_output, uint32_t mask_source);

/* get the POC flag */
FlagStatus poc_flag_get(uint32_t flag);

/* clear the POC flag */
void poc_flag_clear(uint32_t flag);

/* enable POC interrupt */
void poc_interrupt_enable(poc_interrupt_enum interrupt);

/* disable POC interrupt */
void poc_interrupt_disable(poc_interrupt_enum interrupt);

/* get POC interrupt flag */
FlagStatus poc_interrupt_flag_get(uint32_t int_flag);

/* clear POC interrupt flag */
void poc_interrupt_flag_clear(uint32_t int_flag);

#endif /* GD32M53X_POC_H */
